InformationRegisters/ра_СтатусыВыгрузкиНесоответствийВЕОСЗакупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ра_СтатусыВыгрузкиНесоответствийВЕОСЗакупки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ра_СтатусВыгрузкиНесоответствийВЕОСЗакупки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>MessageID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Несоответствие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ra_Nesootvetstvie</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяСистемыПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ра_СтатусыВыгрузкиНесоответствийВЕОСЗакупки/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(Несоответствие, ИмяСистемы, Статус, MessageID, ТекстОшибки) Экспорт 
	
	Если Не (ЗначениеЗаполнено(Несоответствие)
		И ЗначениеЗаполнено(ИмяСистемы)
		И ЗначениеЗаполнено(Статус)
		И ЗначениеЗаполнено(MessageID)) Тогда 
		// такого быть не должно, но проверку добавим
		Возврат;
	КонецЕсли;	
		
	Запись = РегистрыСведений.ра_СтатусыВыгрузкиНесоответствийВЕОСЗакупки.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.Несоответствие = Несоответствие;
	Запись.ИмяСистемыПолучателя = ИмяСистемы;
	Запись.Статус = Статус;
	Запись.MessageID = MessageID;
	Запись.ТекстОшибки = ТекстОшибки;
	Запись.Записать();
	
КонецПроцедуры
